{
  "navigation": {
    "main": "Главная",
    "about": "Обо мне",
    "portfolio": "Портфолио (мои проекты)",
    "career": "Карьера",
    "comments": "Отзывы",
    "contacts": "Контакты"
  },
  "main": {
    "name":"Максим Филанович",
    "activity": "Front-End разработчик"
  },
  "about": {
    "name": "Максим Филанович",
    "activity": "Front-End разработчик",
    "years": "лет",
    "description": "In consequat ad ad do labore velit mollit dolore pariatur esse.Consequat non fugiat qui exercitation consequat quis ex officia culpa.",
    "skills": "Ключевые навыки",
    "cv-download-text": "Скачать резюме"
  },
  "portfolio": {
    "more-button": "Подробнее",
    "description-text": "Описание",
    "open-github-text": "Открыть ссылку на gihub",
    "open-demo-text": "Открыть ссылку на демо",
    "open-youtube-text": "Открыть ссылку на промо-видео в YouTube",
    "projects": {
      "rslang": {
        "description": "Целью проекта было создание веб-приложения для изучения английского языка, которое было бы похоже на сайт Lingualeo. RS Lang должен был включать 6 мини-игр, 1 основную игру, словарь, статистику и настройки.\nДля достижения этой цели мы собрали команду из 6 человек (включая меня). Я был тимлидом проекта. Мы использовали Trello для отслеживания прогресса проекта, Git для организации кода участников команды и проведения проверки кода, библиотеку ChartJS для графиков на странице статистики и др.\n Проект разрабатывался в течение 1 месяца и конечная цель по разрабатываемому приложению была достигнута."
      },
      "english-for-kids": {
        "description": "Целью проекта было создание веб-приложения, которое позволит детям изучать английский язык с помощью картинок и аудио. Оно должно было включать 8 категорий слов и страницу статистики.\nДля того, чтобы страница была более красивой и приятной для детей, я воспользовался помощью дизайнера, который создал макет в Figma.\nС помощью макета Figma я разработал стили страницы для ПК и мобильных устройств, чтобы дети могли изучать английский, использую любой девайс.\nДля создания функциональности я использовал аудио API и Native JS.\n\nПосле нажатия на карточку ребенок слышит звук слова. Также есть режим игры, в котором дети могут угадывать карточки, прослушивая их аудио.\n\nПроект был разработан за 3 недели, и все основные критерии были выполнены. Младшие сестры и братья моих друзей протестировали приложение. Дети были счастливы изучать английский язык с помощью веб-приложения English for Kids."
      },
      "fancy-weather": {
        "description": "Целью проекта было создание приложения, которое позволяет пользователям проверить погоду практически в любой точке мира, слушать аудиопрогноз, управлять приложением с помощью голоса, изменять фоновое изображение, менять язык (en, ru, by).\n\nFancyWeather был разработан с использованием сторонних API. Например: \n- Mapbox GJ JS для карты; \n- OpenWeather для прогнозов погоды; \n- IP-info для получения данных о геолокации пользователя; \n- SpeechRecognition API для голосового управления;\n\nДополнительные библиотеки, используемые в приложении:\n- библиотека react-i18next использовалась для интернационализации. Есть 3 языка: английский, русский, белорусский;\n- Moment.JS для форматов времени; \n\nТакже есть анимированные значки для привлекательности приложения.\n\nПосле завершения разработки приложения я отправил его своим друзьям, чтобы проверить его на наличие ошибок. Все мои друзья остались довольны. Они сказали, что приложение выглядит привлекательно для пользователя и предоставляет все необходимые функции для проверки погодных условий. Но была одна проблема с используемым IP Info API. Иногда оно показывало неправильное местоположение для небольших населенных пунктов, но отзывы в основном были положительными."
      },
      "singolo": {
        "description": "Целью проекта было создание адаптивной landing-страницы со слайдером/свайпером, навигацией и формой отправки данных. \nДля ее разработки я использовал CSS для стилей и JavaScript для основных функций (якоря, слайдер).\nПроект был создан за 3 недели."
      },
      "movie-search": {
        "description": "Целью проекта было разработать веб-страницу, которая позволит пользователю находить свои любимые фильмы, проверять их IMDb-рейтинг и другую информацию. Также нужно было добавить виртуальную клавиатуру для пользователей, у которых не работает реальная клавиатура. \n\nДля достижения цели проекта я использовал JavaScript для функциональности, SCSS для стилей, Webpack для сборки кода. \n\nВсе основные требования были выполнены за 2,5 недели."
      },
      "songbird": {
        "description": "Songbird - это приложение, в котором вы можете проверить свои знания голосов птиц.\n\nЕсть 6 типов птиц:\n- Разные птицы,\n- Болотные птицы,\n- Птицы пустыни,\n- Тропические птицы,\n- Домашние птицы,\n- Африканские птицы.\n\nЕсли вы безошибочно угадаете всех птиц, вы получите сертификат специалиста по птичьим голосам!"
      },
      "todo": {
        "description": "Целью проекта было создание приложения ToDo со следующей функциональностью: \n\n - создание и удаление задач; \n - сортировка задач по срокам; \n - изменение вида приложения (4 квадрата или единый список); \n- Изменение темы и фонового изображения; \n\nДля разработки этого веб-приложения я использовал такие современные библиотеки, как React и Redux. Также использовал SCSS для стилей. \n\nВ конце проекта основные требования были успешно выполнены."
      },
      "virtual-keyboard": {
        "description": "Виртуальная клавиатура - прототип реальной клавиатуры. Она имеет такие функции, как: \n\n- переключение языка; \n- ввод текста в верхнем регистре; \n- эффект нажатия кнопки; \n\nВы можете встроить ее в ваш код и использовать в своем приложении! Ссылка на исходный код находится выше."
      },
      "scrum-video": {
        "description": "Задачей этого проекта было создать видео на любую тему из определенного списка. Я выбрал Scrum, потому что этот фреймворк вдохновил меня, когда я читал книгу Максима Дорофеева 'Джедайские техники'."
      }
    }
  },
  "career": {
    "steps": {
      "php": {
        "title": "Самостоятельно изучал PHP",
        "description": "Не понравилось - бросил это дело",
        "period": "Июль-Август 2019 (1.5 месяца)"
      },
      "js-self-education": {
        "title": "Начал заниматься JS",
        "description": "Самостоятльно изучал JavaScript и также поработал с такими фреймворками этого языка, как React и Redux. Написал ToDo-приложение на React и Redux.",
        "period": "Сентябрь 2019-Феварль 2020 (6 месяцев)"
      },
      "rs-js-single-projects": {
        "title": "Записался на курсы {rolling-scopes-link} по JavaScript от компании EPAM",
        "description": "За этот период разработал 6 проектов (5 написаны на JavaScript, 1 - на React) и снял 1 видео на YouTube",
        "period": "Феварль-Май 2020 (5 месяцев)"
      },
      "rs-js-team-projects": {
        "title": "Был тимлидом проекта RS Lang",
        "description": "За время разработки проекта получил навыки в управлении проектами, так как являлся тимлидом команды разработчиков из 5 человек. Разработанный проект похож на всеми известное приложение по изучению английского языка {lingualeo-link}. Наш же командный проект называется RS Lang. В приложении есть 7 игр, сохраняется долгосрочная и краткосрочная статистика, а также имеется словарь для сохранения английских слов. Данный проект RS Lang является самой тяжелой задачей, с которой я когда-либо встречался в разработке приложений и с которым я и моя команда успешно справились.",
        "period": "Май-Июль 2020 (1 месяц)"
      },
      "rs-js-course-finish": {
        "title": "Был тимлидом проекта RS Lang",
        "description": "За время разработки проекта получил навыки в управлении проектами, так как являлся тимлидом команды разработчиков из 5 человек. Разработанный проект похож на всеми известное приложение по изучению английского языка {lingualeo-link}. Наш же командный проект называется RS Lang. В приложении есть 7 игр, сохраняется долгосрочная и краткосрочная статистика, а также имеется словарь для сохранения английских слов. Данный проект RS Lang является самой тяжелой задачей, с которой я когда-либо встречался в разработке приложений и с которым я и моя команда успешно справились.",
        "period": "Май-Июль 2020 (1 месяц)"
      },
      "epam-fail": {
        "title": "Был тимлидом проекта RS Lang",
        "description": "За время разработки проекта получил навыки в управлении проектами, так как являлся тимлидом команды разработчиков из 5 человек. Разработанный проект похож на всеми известное приложение по изучению английского языка {lingualeo-link}. Наш же командный проект называется RS Lang. В приложении есть 7 игр, сохраняется долгосрочная и краткосрочная статистика, а также имеется словарь для сохранения английских слов. Данный проект RS Lang является самой тяжелой задачей, с которой я когда-либо встречался в разработке приложений и с которым я и моя команда успешно справились.",
        "period": "Май-Июль 2020 (1 месяц)"
      },
      "rs-react": {
        "title": "Записался на курсы {rolling-scopes-link} по React от компании EPAM",
        "description": "На этом курсе продложаю изучать самую используемую библиотеку во Front-End разработке - React.",
        "period": "Август-Сейчас 2020"
      }
    }
  },
  "contacts": {
    "title": "Вы можете найти меня и связаться со мной любым способом ниже"
  },
  "footer": {
    "offer": "Хочешь себе похожую веб-страницу?",
    "button-confirm-text": "Да!"
  },
  "pop-up-offer": {
    "title": "Хочешь себе похожую веб-страницу?",
    "description": "Напиши мне и я тебе сделаю твою персональную страничку!",
    "button-confirm-text": "Написать"
  },
  "comments": {
    "commentators": {
      "ekaterina_latushkina": {
        "name": "Екатерина Латушкина",
        "text": "С Максимом я познакомилась недавно, когда мы вместе, участь в Roling Scopes School, начали выполнять командный таск по JavaScript. Именно тогда мне посчастливилось работать с ним. Уже в самом начале выполнения задания было понятно, что это именно тот человек, который поможет каждому с его ошибками и багами, который сможет возложить на себя роль TeamLead и справится с ней.\nОн организовывал еженедельные митинги, где каждый участник команды рассказывал о проблемах возникших за неделю, о планировании своей работы на следующую неделю и о своем прогрессе, координировал команду и прислушивался к каждой идее, которые в будущем мы воплощали в проекте. Наверное, благодаря ему наша команда и проект смогли войти в топ 5 среди всех проектов школы. \nПо окончанию курсов он вошел в топ 10 и я гордилась, что работала целый месяц с этим человеком. Я многому научилась у него и до сих пор обращаюсь за помощью к нему, зная что его знания и опыт помогут мне хоть немного стать таким же крутым frontend программистом как и он.",
        "date": "18.08.2020 10:59"
      },
      "kirill_zdanov": {
        "name": "Кирилл Жданов",
        "text": "Максим это человек с сильной мотивацией в разработке,иногда может ей заражать других) Если стоит задача,то он старается выполнить её как можно быстрее(иногда создаётся ощущение что 24/7 что-то для проекта делает). Старается писать код качественно,придерживается стандартов. В целом оцениваю как командного разработчика с огромной мотивацией и отличными навыками в написании JS кода.",
        "date": "19.08.2020 08:49"
      },
      "alexander_treska": {
        "name": "Александр Треска",
        "text": "Максим - человек, настроенный достигнуть высоких результатов в области front-end разработки. Никакие сложности : в коде, в жизни, по здоровью - не мешают ему двигаться к своим целям. Он максимально грамотно располагает своим временем, поэтому буквально за небольшие сроки он смог развить как личные, так и рабочие навыки!",
        "date": "18.08.2020 20:09"
      },
      "anton_andreev": {
        "name": "Антон Андреев",
        "text": "Максим очень ответственный и инитиациативный разработчик,готовый помочь всегда и везде. Я восхищён качеством его frontend-разработки и трудолюбием, с которым он подходит к той или иной задаче.",
        "date": "18.08.2020 10:44"
      }
    }
  }
}